# Код Морзе для представления цифр и букв использует тире и точки.
#
# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...',
         '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']

d = dict(zip(letters, morse))


def solution(__word: str) -> None:
    result = []
    for char in __word.upper():
        if char in d:
            result.append(d[char])
    print(*result)


solution(input())
